let signID = new Number(sessionStorage.getItem('sign'));

let peoples = [['Шлюха спидозная на трассе'],["Дмитрий Нагиев", "Адольф Гитлер", "Алла Пугачева", "Джеки Чан", "Иван Ургант", "Баста", "Джигурда", "Эмма Уотсон", "Леди Гага", "Игорь Акинфеев", "Никита Хрущёв", "Николай Гоголь", "Стивен Сигал", "Корней Чуковский", "Андрей Гайдулян"],
["Филипп Киркоров", "Владимир Ленин", "Владимир Жириновский", "Марк Цукерберг", "Дуэйн Джонсон", "Эмбер <s>Хёрд</s> Хуёрд", "Федор Бондарчук", "Зигмунд Фрейд", "Николай II", "Александр Пушной", "Сальвадор Дали", "Уильям Шекспир", "habaisuniversegod (Я)"],
["Дональд Трамп", "Лариса Гузеева", "Виктор Цой", "Мэрилин Монро", "Анджелина Джоли", "Алексей Навальный", "Джонни Депп", "Максим Галкин", "Александр Пушкин", "Принц Уильям", "Скриптонит", "Канье Уэст", "Морган Фримен", "A4", "Сергей Собянин"],
["Егор Крид", "Лионель Месси", "Вин Дизель", "Илон Маск", "Иван Охлобыстин", "Григорий Лепс", "Владимир Маяковский", "Жанна Фриске", "Ангела Меркель", "Элджей", "Сильвестр Сталлоне", "Том Круз", "Тоби Магуайр", "Эрнест Хемингуэй"],
["Барак Обама", "Тимати", "Клава Кока", "Арнольд Шварцнеггер", "Джейсон Стейтем", "Джиган", "Бенито Муссолини", "Олег Табаков", "Сергей Мавроди", "Кристофер Нолан", "Джоан Роулинг", "Михаил Горшенев", "Дмитрий Пучков"],
["Александр Лукашенко", "Дмитрий Медведев", "Майкл Джексон", "Александр Ревва", "Хабиб Нурмагомедов", "Лев Толстой", "Фредди Меркьюри", "Александр Розенбаум", "Джон Локк", "Киану Ривз", "Пол Уокер", "Владимир Епифанцев"],
["Владимир Путин", "Сергей Есенин", "Тима Белорусских", "Николай Басков", "Уилл Смит", "Павел Дуров", "Эминем", "Ким Кардашьян", "Жан-Клод Ван Дамм", "Михаил Лермонтов", "Юрий Дудь", "Марина Цветаева", "Марьяна Ро", "Майкл Дуглас"],
["Леонардо Дикаприо", "Михаил Галустян", "Федор Достоевский", "Билл Гейтс", "Лев Троцкий", "Кэти Перри", "Джо Байден", "Райан Гослинг", "Сергей Дружко", "Иван Тургенев", "Максим Голополосов", "Pewdiepie", "Валя Карнавал"],
["Иосиф Сталин", "Билли Айлиш", "Леонид Брежнев", "Уинстон Черчилль", "Брэд Питт", "Брюс Ли", "Георгий Жуков", "Александр Блок", "Прохор Шаляпин", "Ларин", "Эммануэль Макрон", "Даня Милохин", "Оззи Осборн"],
["Ольга Бузова", "Дима Билан", "Джим Керри", "Стивен Хокинг", "Михаил Боярский", "Элвис Пресли", "Олег Тиньков", "Юрий Хованский"],
["Алишер Моргенштерн", "Криштиану Роналду", "Ванга", "Борис Ельцин", "Антон Чехов", "Владимир Зеленский", "Владимир Высоцкий", "Майкл Джордан", "Оксимирон", "Витас", "Эд Ширан", "Ким Чен Ир", "Григорий Распутин", "Леонид Гайдай"],
["Павел Воля", "Стив Джобс", "Альберт Эйнштейн", "Гарик Харламов", "Юрий Гагарин", "Джастин Бибер", "Брюс Уиллис", "Михаил Горбачев", "Михаил Мишустин", "Евгений Понасенков", "Курт Кобейн", "Николай Римский-Корсаков"]];
let signs = ['undefined', 'Овен', 'Телец', 'Близнецы', 'Рак' ,'Лев' ,'Дева' ,'Весы' ,'Скорпион', 'Стрелец' ,'Козерог' ,'Водолей' ,'Рыбы'];

let sign = document.getElementById('sign'); 
let image = document.getElementById('image');

image.outerHTML = '<img src="images/z_'+signID+'.png" width="20%" id="image">';
sign.innerHTML = signs[signID];
if (signID == 0) document.getElementsByTagName('p')[0].innerHTML = "Выше все написано, уёбок!";

for(let i = 0; i < peoples[signID].length; i++){
	document.write('<li>'+peoples[signID][i]+'</li>');
}
if (signID == 9) document.write('<p>Ну и самый главный:</p><li><img src="images/temonoid.jpg" width="90px" id="temych"></li>');